Code-Newborn/STM32H743VITX_UCOSIII308/HARDWARE/ICM20602/SEEKFREE_ICM20602.c
/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2018,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：一群：179029047(已满)  二群：244861897
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file       		ICM20602
 * @company	   		成都逐飞科技有限公司
 * @author     		逐飞科技(QQ3184284598)
 * @version    		查看doc内version文件 版本说明
 * @Software 		IAR 8.3 or MDK 5.24
 * @Taobao   		https://seekfree.taobao.com/
 * @date       		2019-04-30
 * @note
                    接线定义：
                    ------------------------------------
                        SCL                 查看SEEKFREE_IIC文件内的SEEKFREE_SCL宏定义
                        SDA                 查看SEEKFREE_IIC文件内的SEEKFREE_SDA宏定义
                    ------------------------------------
 ********************************************************************************************************************/

#include "stm32h7xx_hal.h"
#include "SEEKFREE_ICM20602.h"
#include "spi.h"

int16_t icm_gyro_x, icm_gyro_y, icm_gyro_z;
int16_t icm_acc_x, icm_acc_y, icm_acc_z;

//-------------------------------------------------------------------------------------------------------------------
//  以下函数是使用硬件SPI通信，相比较IIC，速度比IIC快非常多。
//-------------------------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------------------------
//  @brief      ICM20602 SPI写寄存器
//  @param      cmd     寄存器地址
//  @param      val     需要写入的数据
//  @return     void
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void icm_spi_w_reg_byte(uint8_t cmd, uint8_t val)
{
    uint8_t dat[2];
    HAL_GPIO_WritePin(ICM_CS_GPIO_Port, ICM_CS_Pin, GPIO_PIN_RESET);

    dat[0] = cmd | ICM20602_SPI_W;
    dat[1] = val;
    HAL_SPI_Transmit(&hspi1, dat, 2, 0xFFFF);

    HAL_GPIO_WritePin(ICM_CS_GPIO_Port, ICM_CS_Pin, GPIO_PIN_SET);
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      ICM20602 SPI读寄存器
//  @param      cmd     寄存器地址
//  @param      *val    接收数据的地址
//  @return     void
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------

void icm_spi_r_reg_byte(uint8_t cmd, uint8_t *val)
{
    uint8_t dat[2];

    HAL_GPIO_WritePin(ICM_CS_GPIO_Port, ICM_CS_Pin, GPIO_PIN_RESET);
    dat[0] = cmd | ICM20602_SPI_R;
    dat[1] = *val;
    HAL_SPI_TransmitReceive(&hspi1, dat, dat, 2, 0xFFFF);

    HAL_GPIO_WritePin(ICM_CS_GPIO_Port, ICM_CS_Pin, GPIO_PIN_SET);

    *val = dat[1];
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      ICM20602 SPI多字节读寄存器
//  @param      cmd     寄存器地址
//  @param      *val    接收数据的地址
//  @param      num     读取数量
//  @return     void
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void icm_spi_r_reg_bytes(uint8_t *val, uint8_t num)
{
    HAL_GPIO_WritePin(ICM_CS_GPIO_Port, ICM_CS_Pin, GPIO_PIN_RESET);
    HAL_SPI_TransmitReceive(&hspi1, val, val, num, 500);
    HAL_GPIO_WritePin(ICM_CS_GPIO_Port, ICM_CS_Pin, GPIO_PIN_SET);
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      ICM20602自检函数
//  @param      NULL
//  @return     void
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void icm20602_self3_check(void)
{
    uint8_t dat = 0;
    while (0x12 != dat) // 读取ICM20602 ID
    {
        icm_spi_r_reg_byte(ICM20602_WHO_AM_I, &dat);
        HAL_Delay(10);
        // 卡在这里原因有以下几点
        // 1 MPU6050坏了，如果是新的这样的概率极低
        // 2 接线错误或者没有接好
        // 3 可能你需要外接上拉电阻，上拉到3.3V
    }
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      初始化ICM20602
//  @param      NULL
//  @return     void
//  @since      v1.0
//  Sample usage:
//-------------------------------------------------------------------------------------------------------------------
void icm20602_init_spi(void)
{
    uint8_t val = 0x0;

    HAL_Delay(10); // 上电延时

    icm20602_self3_check(); // 检测

    icm_spi_w_reg_byte(ICM20602_PWR_MGMT_1, 0x80); // 复位设备
    HAL_Delay(2);
    do
    { // 等待复位成功
        icm_spi_r_reg_byte(ICM20602_PWR_MGMT_1, &val);
    } while (0x41 != val);

    icm_spi_w_reg_byte(ICM20602_PWR_MGMT_1, 0x01);     // 时钟设置
    icm_spi_w_reg_byte(ICM20602_PWR_MGMT_2, 0x00);     // 开启陀螺仪和加速度计
    icm_spi_w_reg_byte(ICM20602_CONFIG, 0x01);         // 176HZ 1KHZ
    icm_spi_w_reg_byte(ICM20602_SMPLRT_DIV, 0x07);     // 采样速率 SAMPLE_RATE = INTERNAL_SAMPLE_RATE / (1 + SMPLRT_DIV)
    icm_spi_w_reg_byte(ICM20602_GYRO_CONFIG, 0x18);    // ±2000 dps
    icm_spi_w_reg_byte(ICM20602_ACCEL_CONFIG, 0x10);   // ±8g
    icm_spi_w_reg_byte(ICM20602_ACCEL_CONFIG_2, 0x03); // Average 4 samples   44.8HZ   //0x23 Average 16 samples
    // ICM20602_GYRO_CONFIG寄存器
    // 设置为:0x00 陀螺仪量程为:±250 dps     获取到的陀螺仪数据除以131           可以转化为带物理单位的数据，单位为：°/s
    // 设置为:0x08 陀螺仪量程为:±500 dps     获取到的陀螺仪数据除以65.5          可以转化为带物理单位的数据，单位为：°/s
    // 设置为:0x10 陀螺仪量程为:±1000dps     获取到的陀螺仪数据除以32.8          可以转化为带物理单位的数据，单位为：°/s
    // 设置为:0x18 陀螺仪量程为:±2000dps     获取到的陀螺仪数据除以16.4          可以转化为带物理单位的数据，单位为：°/s

    // ICM20602_ACCEL_CONFIG寄存器
    // 设置为:0x00 加速度计量程为:±2g          获取到的加速度计数据 除以16384      可以转化为带物理单位的数据，单位：g(m/s^2)
    // 设置为:0x08 加速度计量程为:±4g          获取到的加速度计数据 除以8192       可以转化为带物理单位的数据，单位：g(m/s^2)
    // 设置为:0x10 加速度计量程为:±8g          获取到的加速度计数据 除以4096       可以转化为带物理单位的数据，单位：g(m/s^2)
    // 设置为:0x18 加速度计量程为:±16g         获取到的加速度计数据 除以2048       可以转化为带物理单位的数据，单位：g(m/s^2)
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      获取ICM20602加速度计数据
//  @param      NULL
//  @return     void
//  @since      v1.0
//  Sample usage:				执行该函数后，直接查看对应的变量即可
//-------------------------------------------------------------------------------------------------------------------
void get_icm20602_accdata_spi(void)
{
    struct
    {
        uint8_t reg;
        uint8_t dat[6];
    } buf;

    buf.reg = ICM20602_ACCEL_XOUT_H | ICM20602_SPI_R;

    icm_spi_r_reg_bytes(&buf.reg, 7);
    icm_acc_x = (int16_t)(((uint16_t)buf.dat[0] << 8 | buf.dat[1]));
    icm_acc_y = (int16_t)(((uint16_t)buf.dat[2] << 8 | buf.dat[3]));
    icm_acc_z = (int16_t)(((uint16_t)buf.dat[4] << 8 | buf.dat[5]));
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      获取ICM20602陀螺仪数据
//  @param      NULL
//  @return     void
//  @since      v1.0
//  Sample usage:				执行该函数后，直接查看对应的变量即可
//-------------------------------------------------------------------------------------------------------------------
void get_icm20602_gyro_spi(void)
{
    struct
    {
        uint8_t reg;
        uint8_t dat[6];
    } buf;

    buf.reg = ICM20602_GYRO_XOUT_H | ICM20602_SPI_R;

    icm_spi_r_reg_bytes(&buf.reg, 7);
    icm_gyro_x = (int16_t)(((uint16_t)buf.dat[0] << 8 | buf.dat[1]));
    icm_gyro_y = (int16_t)(((uint16_t)buf.dat[2] << 8 | buf.dat[3]));
    icm_gyro_z = (int16_t)(((uint16_t)buf.dat[4] << 8 | buf.dat[5]));
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      将ICM20602数据转化为带有物理单位的数据
//  @param      NULL
//  @return     void
//  @since      v1.0
//  Sample usage:               执行该函数后，直接查看对应的变量即可
//-------------------------------------------------------------------------------------------------------------------
float unit_icm_gyro_x;
float unit_icm_gyro_y;
float unit_icm_gyro_z;

float unit_icm_acc_x;
float unit_icm_acc_y;
float unit_icm_acc_z;
void icm20602_data_change(void)
{
    // ICM20602_GYRO_CONFIG寄存器
    // 设置为:0x00 陀螺仪量程为:±250 dps     获取到的陀螺仪数据除以131           可以转化为带物理单位的数据， 单位为：°/s
    // 设置为:0x08 陀螺仪量程为:±500 dps     获取到的陀螺仪数据除以65.5          可以转化为带物理单位的数据，单位为：°/s
    // 设置为:0x10 陀螺仪量程为:±1000dps     获取到的陀螺仪数据除以32.8          可以转化为带物理单位的数据，单位为：°/s
    // 设置为:0x18 陀螺仪量程为:±2000dps     获取到的陀螺仪数据除以16.4          可以转化为带物理单位的数据，单位为：°/s

    // ICM20602_ACCEL_CONFIG寄存器
    // 设置为:0x00 加速度计量程为:±2g          获取到的加速度计数据 除以16384      可以转化为带物理单位的数据，单位：g(m/s^2)
    // 设置为:0x08 加速度计量程为:±4g          获取到的加速度计数据 除以8192       可以转化为带物理单位的数据，单位：g(m/s^2)
    // 设置为:0x10 加速度计量程为:±8g          获取到的加速度计数据 除以4096       可以转化为带物理单位的数据，单位：g(m/s^2)
    // 设置为:0x18 加速度计量程为:±16g         获取到的加速度计数据 除以2048       可以转化为带物理单位的数据，单位：g(m/s^2)
    unit_icm_gyro_x = (float)icm_gyro_x / 16.4f;
    unit_icm_gyro_y = (float)icm_gyro_y / 16.4f;
    unit_icm_gyro_z = (float)icm_gyro_z / 16.4f;

    unit_icm_acc_x = (float)icm_acc_x / 4096;
    unit_icm_acc_y = (float)icm_acc_y / 4096;
    unit_icm_acc_z = (float)icm_acc_z / 4096;
}

float inclination_x; // 与X轴线夹角
float inclination_y; // 与Y轴线夹角
float inclination_z; // 与Z轴线夹角
void icm20602_inclination(void)
{
    float inclination_z_ = 0;
    inclination_x = atanf(unit_icm_acc_x / sqrtf(pow(unit_icm_acc_y, 2) + pow(unit_icm_acc_z, 2))) * RAD2DEG;  // 传感器X轴偏离角度
    inclination_y = atanf(unit_icm_acc_y / sqrtf(pow(unit_icm_acc_x, 2) + pow(unit_icm_acc_z, 2))) * RAD2DEG;  // 传感器Y轴偏离角度
    inclination_z_ = atanf(unit_icm_acc_z / sqrtf(pow(unit_icm_acc_x, 2) + pow(unit_icm_acc_y, 2))) * RAD2DEG; // 传感器Z轴偏离角度
    inclination_z = 90.0f - inclination_z_;                                                                    // 传感器Z轴偏离重力方向
}
